/**
  ******************************************************************************
  * @author  泽耀科技 ASHINING
  * @version V3.0
  * @date    2016-10-08
  * @brief   主函数C文件
  ******************************************************************************
  * @attention
  *
  * 官网	:	http://www.ashining.com
  * 淘宝	:	https://shop105912646.taobao.com
  * 阿里巴巴:	https://cdzeyao.1688.com
  ******************************************************************************
  */

#include "rf_app.h" 

#define DBG_TAG    "rf.app"
#define DBG_LVL    DBG_LOG
#include <rtdbg.h>

const char *g_Ashining = "**ashining##";
uint8_t g_UartRxBuffer[100] = {0};
uint8_t g_RF24L01RxBuffer[32] = {0};

/**
  * @brief :主函数 
  * @param :无
  * @note  :无
  * @retval:无
  */
void rf_app(void *parameter)
{
    uint8_t i = 0;
LOG_D( "rf_app");
    //LED初始化
    rf_led_init();
    //按键初始化
    rf_button_init();
    //SPI初始化
    rf_spi_init();
    //CC1101初始化
    CC1101_Init();
    for (i = 0; i < 6; i++)
    {
        led_red_flashing();
        led_green_flashing();
        rf_delay_500Ms(1);
    }CC1101_Clear_RxBuffer();
    CC1101_Set_RX_Mode();
    while (1)
    {
        //模式切换
        if ((BUTOTN_PRESS_DOWN == rf_button_check()) && (0 != CC1101_GET_GDO0_STATUS()))
        {
            //状态显示清零
            led_red_off();
            for (i = 0; i < 6; i++)
            {
                led_red_flashing();
                rf_delay_500Ms(1);
            }

            //=========================================================================================//
            //*****************************************************************************************//
            //************************************* 发送 **********************************************//
            //*****************************************************************************************//
            //=========================================================================================//
            CC1101_Tx_Packet((uint8_t *)g_Ashining, 12, ADDRESS_CHECK); //模式1发送固定字符,1S一包
            led_red_flashing();
            rf_delay_500Ms(1);
            led_red_off();
        }
        //=========================================================================================//
        //*****************************************************************************************//
        //************************************* 接收 **********************************************//
        //*****************************************************************************************//
        //=========================================================================================//
        if (0 == CC1101_GET_GDO0_STATUS()) //正在接收状态
        {
            i = CC1101_Rx_Packet(g_RF24L01RxBuffer); //接收字节
            if (0 != i)
            {
                led_green_flashing();
              // rt_kprintf("%s", g_RF24L01RxBuffer ); //输出接收到的字节
               // rt_memset(g_RF24L01RxBuffer,0,sizeof(g_RF24L01RxBuffer));
            }
        }
    }
}
